#+STARTUP: fold indent noinlineimages logdrawer
#+TITLE: Lab Notebook for Transformer Kernel Performance Modeling
#+AUTHOR: Pedro Bruel
#+EMAIL: bruel@hpe.com
#+LANGUAGE: en

#+TAGS: noexport(n)
#+TAGS: ignore(i)

#+OPTIONS: prop:nil
#+OPTIONS: H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w@) APPT(a!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

**** Full simplified code
#+BEGIN_SRC R :tangle generate_plots.R
df <- load_performance_data("results/sc25/astra_sim_measurements/aggregated_A100_factorial_expanded.csv")

ref_df <- create_reference_dataframe(df)

ratio_df <- calculate_performance_ratios(df, ref_df)
save_and_print_ratios(ratio_df, "results/sc25/simulation_results/performance_ratios_A100_factorial_expanded.csv")
print(ratio_df, n = Inf)

# Fitting coefficient curve for models
ratio_df <- load_performance_data("results/sc25/simulation_results/performance_ratios_A100_factorial_expanded.csv")
df_lm_model <- prepare_model_data(ratio_df, "model", 1)
model_fit <- fit_coefficient_model(df_lm_model)

# Fitting coefficient curve for profiling
df_lm_profiling <- prepare_model_data(ratio_df, "profiling", 1)
profiling_fit <- fit_coefficient_model(df_lm_profiling)

coefficient_trend_plots_publication(
    input_file = "results/sc25/simulation_results/performance_ratios_A100_factorial_expanded.csv",
    output_file = "results/sc25/figures/coefficient_faceted_trends_A100_factorial_expanded_publication.pdf",
    grid_size = 32,
    max_ubatch = 2,
    max_gpus = 128,
    output_width = 8,
    output_height = 3.5
)
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 96 × 9
   type   gpus ubatch coef  total_time_ms total_time_ms_ci ref_time ratio_time_ms abs_diff_ratio
   <chr> <dbl>  <dbl> <chr>         <dbl>            <dbl>    <dbl>         <dbl>          <dbl>
 1 model     1      1 0.6           0.961          0.0123     0.869         1.11       0.106
 2 model     1      2 0.8           1.56           0.0146     1.55          1.00       0.00201
 3 model     1      4 1             2.89           0.0278     2.93          0.988      0.0121
 4 model     1      8 1             5.47           0.0489     5.64          0.970      0.0300
 5 model   128      1 1.2           1.85           0.0113     1.82          1.01       0.0142
 6 model   128      2 1.2           2.35           0.0150     2.29          1.03       0.0270
 7 model    16      1 0.9           1.38           0.00947    1.36          1.02       0.0167
 8 model    16      2 1             1.89           0.0108     1.83          1.04       0.0364
 9 model     2      1 0.7           1.05           0.0103     1.05          0.999      0.000945
10 model     2      2 0.9           1.80           0.0200     1.80          1.00       0.0000350
# ℹ 86 more rows
# ℹ Use `print(n = ...)` to see more rows
# A tibble: 96 × 9
   type       gpus ubatch coef  total_time_ms total_time_ms_ci ref_time ratio_time_ms abs_diff_ratio
   <chr>     <dbl>  <dbl> <chr>         <dbl>            <dbl>    <dbl>         <dbl>          <dbl>
 1 model         1      1 0.6           0.961        0.0123       0.869         1.11       0.106
 2 model         1      2 0.8           1.56         0.0146       1.55          1.00       0.00201
 3 model         1      4 1             2.89         0.0278       2.93          0.988      0.0121
 4 model         1      8 1             5.47         0.0489       5.64          0.970      0.0300
 5 model       128      1 1.2           1.85         0.0113       1.82          1.01       0.0142
 6 model       128      2 1.2           2.35         0.0150       2.29          1.03       0.0270
 7 model        16      1 0.9           1.38         0.00947      1.36          1.02       0.0167
 8 model        16      2 1             1.89         0.0108       1.83          1.04       0.0364
 9 model         2      1 0.7           1.05         0.0103       1.05          0.999      0.000945
10 model         2      2 0.9           1.80         0.0200       1.80          1.00       0.0000350
11 model         2      4 1.2           3.41         0.0445       3.37          1.01       0.0120
12 model         2      8 1.2           6.72         0.0328       6.44          1.04       0.0438
13 model        32      1 1             1.57         0.00713      1.61          0.977      0.0231
14 model        32      2 1.1           2.12         0.0155       2.08          1.02       0.0191
15 model         4      1 0.6           0.963        0.00884      1.00          0.960      0.0402
16 model         4      2 0.9           1.77         0.0140       1.74          1.02       0.0204
17 model         4      4 1.2           3.30         0.0304       3.27          1.01       0.00861
18 model         4      8 1.1           6.50         0.0564       6.28          1.04       0.0351
19 model        64      1 1.1           1.76         0.00822      1.74          1.02       0.0154
20 model        64      2 1.2           2.23         0.0168       2.21          1.01       0.00915
21 model         8      1 0.6           0.976        0.00689      1.04          0.942      0.0581
22 model         8      2 0.9           1.71         0.0121       1.75          0.976      0.0235
23 model         8      4 1.2           3.44         0.0374       3.34          1.03       0.0298
24 model         8      8 1.1           6.43         0.0362       6.17          1.04       0.0429
25 profiling     1      1 1.1           0.847        0.000126     0.869         0.975      0.0254
26 profiling     1      2 1.1           1.61         0.00208      1.55          1.04       0.0385
27 profiling     1      4 0.9           2.81         0.00165      2.93          0.961      0.0390
28 profiling     1      8 0.9           5.60         0.00622      5.64          0.992      0.00829
29 profiling   128      1 2.1           1.64         0.000137     1.82          0.898      0.102
30 profiling   128      2 1.5           2.23         0.00223      2.29          0.975      0.0254
31 profiling    16      1 1.6           1.25         0.000125     1.36          0.924      0.0761
32 profiling    16      2 1.2           1.79         0.00179      1.83          0.978      0.0224
33 profiling     2      1 1.4           1.08         0.000147     1.05          1.03       0.0285
34 profiling     2      2 1.2           1.76         0.00221      1.80          0.978      0.0219
35 profiling     2      4 1.1           3.42         0.00349      3.37          1.02       0.0155
36 profiling     2      8 1.0           6.18         0.00462      6.44          0.960      0.0402
37 profiling    32      1 2.1           1.63         0.000140     1.61          1.01       0.0121
38 profiling    32      2 1.4           2.08         0.00221      2.08          0.999      0.000552
39 profiling     4      1 1.3           1.02         0.0000956    1.00          1.02       0.0164
40 profiling     4      2 1.2           1.78         0.00312      1.74          1.02       0.0249
41 profiling     4      4 1.0           3.12         0.00182      3.27          0.954      0.0459
42 profiling     4      8 1.0           6.18         0.00725      6.28          0.983      0.0168
43 profiling    64      1 2.1           1.64         0.000261     1.74          0.942      0.0579
44 profiling    64      2 1.5           2.22         0.00195      2.21          1.01       0.00678
45 profiling     8      1 1.3           1.03         0.000115     1.04          0.995      0.00506
46 profiling     8      2 1.2           1.78         0.00192      1.75          1.01       0.0140
47 profiling     8      4 1.1           3.44         0.00209      3.34          1.03       0.0297
48 profiling     8      8 1.0           6.21         0.00734      6.17          1.01       0.00764
49 roofline      1      1 no            0.569        0            0.869         0.655      0.345
50 roofline      1      2 no            1.11         0            1.55          0.717      0.283
51 roofline      1      4 no            2.21         0            2.93          0.753      0.247
52 roofline      1      8 no            4.39         0            5.64          0.778      0.222
53 roofline    128      1 no            0.736        0            1.82          0.403      0.597
54 roofline    128      2 no            1.28         0            2.29          0.559      0.441
55 roofline     16      1 no            0.669        0            1.36          0.492      0.508
56 roofline     16      2 no            1.21         0            1.83          0.663      0.337
57 roofline      2      1 no            0.618        0            1.05          0.588      0.412
58 roofline      2      2 no            1.16         0            1.80          0.645      0.355
59 roofline      2      4 no            2.25         0            3.37          0.667      0.333
60 roofline      2      8 no            4.42         0            6.44          0.687      0.313
61 roofline     32      1 no            0.678        0            1.61          0.420      0.580
62 roofline     32      2 no            1.22         0            2.08          0.588      0.412
63 roofline      4      1 no            0.645        0            1.00          0.643      0.357
64 roofline      4      2 no            1.19         0            1.74          0.684      0.316
65 roofline      4      4 no            2.27         0            3.27          0.694      0.306
66 roofline      4      8 no            4.45         0            6.28          0.708      0.292
67 roofline     64      1 no            0.696        0            1.74          0.401      0.599
68 roofline     64      2 no            1.24         0            2.21          0.561      0.439
69 roofline      8      1 no            0.659        0            1.04          0.636      0.364
70 roofline      8      2 no            1.20         0            1.75          0.686      0.314
71 roofline      8      4 no            2.29         0            3.34          0.685      0.315
72 roofline      8      8 no            4.46         0            6.17          0.723      0.277
73 real        128      1 NA            1.82         0.00194      1.82          1          0
74 real        128      2 NA            2.29         0.00461      2.29          1          0
75 real         16      1 NA            1.36         0.00181      1.36          1          0
76 real         16      2 NA            1.83         0.00552      1.83          1          0
77 real          1      1 NA            0.869        0.0144       0.869         1          0
78 real          1      2 NA            1.55         0.0103       1.55          1          0
79 real          1      4 NA            2.93         0.00911      2.93          1          0
80 real          1      8 NA            5.64         0.00642      5.64          1          0
81 real          2      1 NA            1.05         0.0359       1.05          1          0
82 real          2      2 NA            1.80         0.0318       1.80          1          0
83 real          2      4 NA            3.37         0.0243       3.37          1          0
84 real          2      8 NA            6.44         0.0126       6.44          1          0
85 real         32      1 NA            1.61         0.00274      1.61          1          0
86 real         32      2 NA            2.08         0.00357      2.08          1          0
87 real          4      1 NA            1.00         0.0352       1.00          1          0
88 real          4      2 NA            1.74         0.0301       1.74          1          0
89 real          4      4 NA            3.27         0.0301       3.27          1          0
90 real          4      8 NA            6.28         0.0267       6.28          1          0
91 real         64      1 NA            1.74         0.00341      1.74          1          0
92 real         64      2 NA            2.21         0.00803      2.21          1          0
93 real          8      1 NA            1.04         0.0739       1.04          1          0
94 real          8      2 NA            1.75         0.0401       1.75          1          0
95 real          8      4 NA            3.34         0.0741       3.34          1          0
96 real          8      8 NA            6.17         0.0451       6.17          1          0

Call:
lm(formula = formula_str, data = df_lm)

Residuals:
     Min       1Q   Median       3Q      Max
-0.08243 -0.02814 -0.01053  0.02793  0.12836

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  2.40869    0.43059   5.594 0.000162 ***
log(ubatch) -0.52289    0.17780  -2.941 0.013425 *
log(gpus)    0.08280    0.02397   3.454 0.005386 **
I(1/ubatch) -2.49953    0.64114  -3.899 0.002483 **
I(1/gpus)    0.01064    0.09094   0.117 0.908926
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.0662 on 11 degrees of freedom
Multiple R-squared:  0.8263,	Adjusted R-squared:  0.7631
F-statistic: 13.08 on 4 and 11 DF,  p-value: 0.0003657

Call:
lm(formula = formula_str, data = df_lm)

Residuals:
      Min        1Q    Median        3Q       Max
-0.107524 -0.043831  0.000835  0.036035  0.105404

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  0.60732    0.41684   1.457  0.17307
log(ubatch)  0.06812    0.17212   0.396  0.69986
log(gpus)    0.09376    0.02320   4.041  0.00195 **
I(1/ubatch)  0.77772    0.62066   1.253  0.23617
I(1/gpus)    0.06685    0.08803   0.759  0.46358
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.06409 on 11 degrees of freedom
Multiple R-squared:  0.9162,	Adjusted R-squared:  0.8858
F-statistic: 30.08 on 4 and 11 DF,  p-value: 7.207e-06
NULL
NULL
# A tibble: 2 × 1
  ubatch
   <dbl>
1      1
2      2

Call:
lm(formula = coef ~ (log(ubatch) + log(gpus)), data = filter(df,
    type == "model"))

Residuals:
     Min       1Q   Median       3Q      Max
-0.19970 -0.04390  0.01905  0.05476  0.09792

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  0.57292    0.04535  12.633 1.13e-08 ***
log(ubatch)  0.23444    0.06286   3.730  0.00252 **
log(gpus)    0.10906    0.01372   7.951 2.39e-06 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.08714 on 13 degrees of freedom
Multiple R-squared:  0.8558,	Adjusted R-squared:  0.8336
F-statistic: 38.56 on 2 and 13 DF,  p-value: 3.422e-06

NULL
#+end_example

**** Plot
#+BEGIN_SRC R :tangle generate_plots.R
performance_comparison_publication_A100(width = 10,
                                        height = 3)

performance_comparison_publication_H100(width = 10,
                                        height = 4)
#+END_SRC

#+RESULTS:
: NULL
: NULL
: NULL

**** Kernel Space
#+BEGIN_SRC python :tangle generate_plots.py
import subprocess
import os
import math

def generate_parameter_table(kernel_parameters, output_dir=".", filename="kernel_parameters",
                             show_full_range=False, show_decimals=False, use_math_interval=True):
    """
    Generate a compact LaTeX table from a dictionary of kernel parameters,
    including cumulative search space size.

    Args:
        kernel_parameters: Dictionary with parameter names as keys and lists of values as values
        output_dir: Directory to save the output files (default: current directory)
        filename: Base name for the output files (default: kernel_parameters)
        show_full_range: Whether to show all values or just min/max (default: False)
        show_decimals: Whether to show decimal equivalents for powers of 2 (default: False)
        use_math_interval: Whether to use mathematical interval notation [low, high] (default: True)

    Returns:
        Path to the generated PDF file
    """
    # Create output directory if it doesn't exist
    os.makedirs(output_dir, exist_ok=True)

    # Calculate the cumulative search space sizes
    param_names = list(kernel_parameters.keys())
    cumulative_sizes = []
    cumulative_product = 1

    for param in param_names:
        cumulative_product *= len(kernel_parameters[param])
        cumulative_sizes.append(cumulative_product)

    # Start LaTeX document - with tighter borders and better table fitting
    latex_lines = [
        "\\documentclass[border=5pt,varwidth]{standalone}",
        "\\usepackage{booktabs}",
        "\\usepackage{array}",
        "\\usepackage{amsmath}",
        "\\usepackage{siunitx}",  # For scientific notation
        "\\usepackage[table]{xcolor}",
        "\\begin{document}",
        "",
        "\\begin{tabular}{llr}",  # Added third column for search space size
        "\\toprule",
        "\\textbf{Parameter} & \\textbf{Values} & \\textbf{Cummulative Space} \\\\",
        "\\midrule"
    ]

    # Function to format large numbers in scientific notation
    def format_scientific(number):
        if number < 1000:
            return str(number)  # Small numbers as integers
        exponent = math.floor(math.log10(number))
        mantissa = number / (10 ** exponent)
        # Fixed - using proper f-string syntax
        return f"${mantissa:.2f} \\times 10^{{{exponent}}}$"

    # Add rows for each parameter
    for i, param in enumerate(param_names):
        values = sorted(kernel_parameters[param])

        # Check if all values are powers of 2
        is_power_of_2 = all(val & (val-1) == 0 and val > 0 for val in values)

        # Determine which values to show based on show_full_range
        if not show_full_range and len(values) > 2:
            display_values = [min(values), max(values)]
        else:
            display_values = values

        if is_power_of_2:
            # Get exponents for the values to display
            exponents = [int.bit_length(val) - 1 for val in display_values]

            if show_full_range:
                # Show all values (with compact formatting)
                if show_decimals:
                    formatted_values = ", ".join([f"$2^{{{exp}}}\\!=\\!{2**exp}$" for exp in exponents])
                else:
                    formatted_values = ", ".join([f"$2^{{{exp}}}$" for exp in exponents])
            else:
                # Show min/max only
                if len(exponents) == 1:
                    # Only one value
                    if show_decimals:
                        formatted_values = f"$2^{{{exponents[0]}}}\\!=\\!{2**exponents[0]}$"
                    else:
                        formatted_values = f"$2^{{{exponents[0]}}}$"
                else:
                    # Min and max values
                    if use_math_interval:
                        if show_decimals:
                            formatted_values = f"$[2^{{{exponents[0]}}}\\!=\\!{2**exponents[0]}," + \
                                              f"2^{{{exponents[-1]}}}\\!=\\!{2**exponents[-1]}]$"
                        else:
                            formatted_values = f"$[2^{{{exponents[0]}}},2^{{{exponents[-1]}}}]$"
                    else:
                        if show_decimals:
                            formatted_values = f"$2^{{{exponents[0]}}}\\!=\\!{2**exponents[0]}$ to " + \
                                              f"$2^{{{exponents[-1]}}}\\!=\\!{2**exponents[-1]}$"
                        else:
                            formatted_values = f"$2^{{{exponents[0]}}}$ to $2^{{{exponents[-1]}}}$"
        else:
            # For non-powers of 2
            if not show_full_range and len(display_values) > 1:
                if use_math_interval:
                    formatted_values = f"$[{display_values[0]},{display_values[-1]}]$"
                else:
                    formatted_values = f"{display_values[0]} to {display_values[-1]}"
            else:
                formatted_values = ", ".join([str(v) for v in display_values])

        # Escape underscores in parameter names
        param_escaped = param.replace("_", "\\_")

        # Format cumulative search space size
        search_space = format_scientific(cumulative_sizes[i])

        # Add row to table with search space size
        latex_lines.append(f"{param_escaped} & {formatted_values} & {search_space} \\\\")

    # Finish the table and document
    latex_lines.extend([
        "\\bottomrule",
        "\\end{tabular}",
        "",
        "\\end{document}"
    ])

    # Write LaTeX content to file
    tex_file = os.path.join(output_dir, f"{filename}.tex")
    with open(tex_file, "w") as f:
        f.write("\n".join(latex_lines))

    # Compile LaTeX to PDF
    try:
        subprocess.run(["pdflatex", "-output-directory", output_dir, tex_file],
                       check=True, stdout=subprocess.PIPE, stderr=subprocess.PIPE)

        # Clean up auxiliary files
        for ext in [".aux", ".log"]:
            aux_file = os.path.join(output_dir, f"{filename}{ext}")
            if os.path.exists(aux_file):
                os.remove(aux_file)

        print(f"PDF generated and saved to {os.path.join(output_dir, filename)}.pdf")
        return os.path.join(output_dir, f"{filename}.pdf")

    except subprocess.CalledProcessError as e:
        print(f"Error generating PDF: {e}")
        return None

# Example usage
kernel_parameters = {
    "batch": [2**i for i in range(0, 8)],  # 1 to 128
    "max_seq_length": [2**i for i in range(8, 15)],  # 256 to 16384
    "n_embed": [2**i for i in range(10, 15)],  # 1024 to 16384
    "n_head": [2**i for i in range(3, 8)],  # 8 to 128
    "tensor_parallelism": [2**i for i in range(0, 4)],  # 1 to 8
}

generate_parameter_table(kernel_parameters, "results/sc25/figures", "kernel_params")
#+END_SRC

#+RESULTS:
: PDF generated and saved to results/sc25/figures/kernel_params.pdf

***** Improved table
#+BEGIN_SRC R :tangle generate_plots.R
library(tidyverse)
library(knitr)

# Function to format scientific notation with proper LaTeX escaping
format_scientific_latex <- function(x, digits = 2) {
  if(is.na(x) || is.null(x)) return("NA")

  # Parse the number into mantissa and exponent
  exponent <- floor(log10(abs(x)))
  mantissa <- x / 10^exponent

  # Round mantissa to specified digits
  mantissa <- round(mantissa, digits)

  # Format as LaTeX with DOUBLE escaping for backslashes
  return(sprintf("$%.2f \\times 10^{%d}$", mantissa, exponent))
}

# Create the formatted dataframe
df_formatted <- df %>%
  # Create combined y range column with properly escaped LaTeX math symbols
  mutate(test_y_range = sprintf("$y \\in [%.5f, %.5f], \\mu = %.5f$",
                               min_test_y, max_test_y, mean_test_y),
         out_of_confidence_pct = out_of_confidence * 100,
         lin_reg_RMSE_formatted = sapply(lin_reg_RMSE, format_scientific_latex),
         MAE_formatted = sapply(MAE, format_scientific_latex),
         RMSE_formatted = sapply(RMSE, format_scientific_latex),
         name = gsub("_", "\\\\_", name)) %>%
  # Select and arrange columns - grouping similar metrics together
  select(name, gpu,
         R2, lin_reg_R2,
         RMSE_formatted, lin_reg_RMSE_formatted,
         out_of_confidence_pct,
         test_y_range)

# Create a simple LaTeX table manually without using kable
latex_rows <- apply(df_formatted, 1, function(row) {
  sprintf("%s & %s & %.4f & %.4f & %s & %s & %.4f & %s \\\\",
          row["name"], row["gpu"],
          as.numeric(row["R2"]), as.numeric(row["lin_reg_R2"]),
          row["RMSE_formatted"], row["lin_reg_RMSE_formatted"],
          as.numeric(row["out_of_confidence_pct"]),
          row["test_y_range"])
})

# Create complete LaTeX document (figure-style)
latex_document <- c(
  "\\documentclass[border=10pt]{standalone}",
  "\\usepackage{booktabs}",
  "\\usepackage{array}",
  "\\usepackage{amsmath}",
  "\\usepackage[table]{xcolor}",
  "\\begin{document}",
  "",
  "\\begin{tabular}{llrrrrrr}",
  "\\toprule",
  "\\textbf{Kernel} & \\textbf{GPU} & \\textbf{R$^2$} & \\textbf{Lin. Reg. R$^2$} & \\textbf{RMSE} & \\textbf{Lin. Reg. RMSE} & \\textbf{OOC (\\%)} & \\textbf{Test} $y$ \\textbf{Range} \\\\",
  "\\midrule",
  latex_rows,
  "\\bottomrule",
  "\\end{tabular}",
  "",
  "\\end{document}"
)

# Write to file
writeLines(paste(latex_document, collapse = "\n"), "results/sc25/figures/tmp_table_A100_factorial_expanded.tex")

# Now compile to PDF and move to the figures directory
system("pdflatex -output-directory=results/sc25/figures results/sc25/figures/tmp_table_A100_factorial_expanded.tex")
system("mv results/sc25/figures/tmp_table_A100_factorial_expanded.pdf results/sc25/figures/model_performance_table_A100_factorial_expanded.pdf")
system("rm results/sc25/figures/tmp_table_A100_factorial_expanded.aux")

cat("PDF generated and saved to results/sc25/figures/model_performance_table_A100_factorial_expanded.pdf\n")
#+END_SRC

#+RESULTS:
#+begin_example
This is pdfTeX, Version 3.141592653-2.6-1.40.26 (TeX Live 2025/dev/Debian) (preloaded format=pdflatex)
 restricted \write18 enabled.
entering extended mode
(./results/sc25/figures/tmp_table_A100_factorial_expanded.tex
LaTeX2e <2024-11-01> patch level 1
L3 programming layer <2024-12-25>
(/usr/share/texlive/texmf-dist/tex/latex/standalone/standalone.cls
Document Class: standalone 2022/10/10 v1.3b Class to compile TeX sub-files stan
dalone
(/usr/share/texlive/texmf-dist/tex/latex/tools/shellesc.sty)
(/usr/share/texlive/texmf-dist/tex/generic/iftex/ifluatex.sty
(/usr/share/texlive/texmf-dist/tex/generic/iftex/iftex.sty))
(/usr/share/texlive/texmf-dist/tex/latex/xkeyval/xkeyval.sty
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/xkeyval.tex
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/xkvutils.tex
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/keyval.tex))))
(/usr/share/texlive/texmf-dist/tex/latex/standalone/standalone.cfg)
(/usr/share/texlive/texmf-dist/tex/latex/base/article.cls
Document Class: article 2024/06/29 v1.4n Standard LaTeX document class
(/usr/share/texlive/texmf-dist/tex/latex/base/size10.clo)))
(/usr/share/texlive/texmf-dist/tex/latex/booktabs/booktabs.sty)
(/usr/share/texlive/texmf-dist/tex/latex/tools/array.sty)
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsmath.sty
For additional information on amsmath, use the `?' option.
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amstext.sty
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsgen.sty))
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsbsy.sty)
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsopn.sty))
(/usr/share/texlive/texmf-dist/tex/latex/xcolor/xcolor.sty
(/usr/share/texlive/texmf-dist/tex/latex/graphics-cfg/color.cfg)
(/usr/share/texlive/texmf-dist/tex/latex/graphics-def/pdftex.def)
(/usr/share/texlive/texmf-dist/tex/latex/graphics/mathcolor.ltx))
(/usr/share/texlive/texmf-dist/tex/latex/colortbl/colortbl.sty)
(/usr/share/texlive/texmf-dist/tex/latex/l3backend/l3backend-pdftex.def)
No file tmp_table_A100_factorial_expanded.aux.
(/usr/share/texlive/texmf-dist/tex/context/base/mkii/supp-pdf.mkii
[Loading MPS to PDF converter (version 2006.09.02).]
)
[1{/var/lib/texmf/fonts/map/pdftex/updmap/pdftex.map}]
(results/sc25/figures/tmp_table_A100_factorial_expanded.aux) )</usr/share/texli
ve/texmf-dist/fonts/type1/public/amsfonts/cm/cmbx10.pfb></usr/share/texlive/tex
mf-dist/fonts/type1/public/amsfonts/cm/cmmi10.pfb></usr/share/texlive/texmf-dis
t/fonts/type1/public/amsfonts/cm/cmr10.pfb></usr/share/texlive/texmf-dist/fonts
/type1/public/amsfonts/cm/cmr7.pfb></usr/share/texlive/texmf-dist/fonts/type1/p
ublic/amsfonts/cm/cmsy10.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/
amsfonts/cm/cmsy7.pfb>
Output written on results/sc25/figures/tmp_table_A100_factorial_expanded.pdf (1
 page, 64608 bytes).
Transcript written on results/sc25/figures/tmp_table_A100_factorial_expanded.lo
g.
PDF generated and saved to results/sc25/figures/model_performance_table_A100_factorial_expanded.pdf
#+end_example

** The roofline model
#+BEGIN_SRC R :tangle generate_plots.R
library(tidyverse)
library(scales)
library(RColorBrewer)

h100_specs <- tibble(
    gpu = "NVIDIA H100",
    peak_fp32_tflops = 989,
    peak_fp32_standard_tflops = 67,
    memory_bandwidth_gbs = 3350,
    ridge_point_tensor = peak_fp32_tflops / memory_bandwidth_gbs,
    ridge_point_standard = peak_fp32_standard_tflops / memory_bandwidth_gbs
)

ai_values <- tibble(
    arithmetic_intensity = 10^seq(-4, 2.5, by = 0.05)
)

roofline_data <- ai_values %>%
    mutate(
        memory_bound_perf = arithmetic_intensity * h100_specs$memory_bandwidth_gbs,
        compute_bound_tensor = h100_specs$peak_fp32_tflops,
        compute_bound_standard = h100_specs$peak_fp32_standard_tflops,
        attainable_perf_tensor = pmin(memory_bound_perf, compute_bound_tensor),
        attainable_perf_standard = pmin(memory_bound_perf, compute_bound_standard)
    )

set1_colors <- brewer.pal(9, "Set1")[1:3]

roofline_plot <- ggplot() +
    geom_line(data = roofline_data |>
                  filter(arithmetic_intensity <= h100_specs$ridge_point_tensor),
              aes(x = arithmetic_intensity,
                  y = memory_bound_perf,
                  color = "Memory Bandwidth Limit"),
              size = 1) +
    geom_hline(aes(yintercept = h100_specs$peak_fp32_standard_tflops,
                   color = "Standard FP32 Peak Performance"),
               size = 1) +
    geom_hline(aes(yintercept = h100_specs$peak_fp32_tflops,
                   color = "Tensor Cores Peak Performance"),
               size = 1) +
    geom_point(data = h100_specs,
               aes(x = ridge_point_standard,
                   y = peak_fp32_standard_tflops,
                   color = "Memory Bandwidth Limit"),
               show.legend = FALSE,
               size = 3) +
    geom_point(data = h100_specs,
               aes(x = ridge_point_tensor,
                   y = peak_fp32_tflops,
                   color = "Memory Bandwidth Limit"),
               show.legend = FALSE,
               size = 3) +
    scale_x_log10(
        breaks = 10^seq(-4, 5, 1),
        labels = trans_format("log10", math_format(10^.x)),
        limits = c(10^-2.5, 10^2.5)
    ) +
    scale_y_log10(
        limits = c(20, 1200),
        breaks = c(20, 60, 100, 500, 989),
        labels = c("20", "60", "100", "500", "989")
    ) +
    scale_color_manual(
        values = c(
            "Memory Bandwidth Limit" = set1_colors[1],
            "Standard FP32 Peak Performance" = set1_colors[2],
            "Tensor Cores Peak Performance" = set1_colors[3])
    ) +
    labs(
        x = "Arithmetic Intensity (FLOP/Byte)",
        y = "Attainable Performance (TFLOP/s)",
        color = "Performance Limits"
    ) +
    annotate("text",
             x = h100_specs$ridge_point_standard * 2.5,
             y = h100_specs$peak_fp32_standard_tflops * 0.98,
             label = "Ridge Point\n(Standard FP32)",
             size = 3.5) +
    annotate("text",
             x = h100_specs$ridge_point_tensor * 2.5,
             y = h100_specs$peak_fp32_tflops * 0.99,
             label = "Ridge Point\n(Tensor Cores)",
             size = 3.5) +
    theme_bw() +
    theme(
        legend.position = c(0.8, 0.5),
        axis.title = element_text(size = 12),
        legend.title = element_text(size = 11)
    )

example_apps <- tibble(
    name = c("Tensor Compute Bound App.", "Memory Bound App.", "Compute Bound App.", "Tensor Memory Bound App."),
    arithmetic_intensity = c(100, 0.014, 1.5, 0.1),
    performance = c(800, 40, 55, 290)
)

roofline_plot_with_apps <- roofline_plot +
    geom_point(data = example_apps,
               aes(x = arithmetic_intensity, y = performance),
               color = brewer.pal(9, "Set1")[4], size = 4, shape = 17) +
    # geom_text(data = example_apps,
    #           aes(x = arithmetic_intensity, y = performance * 0.82,
    #               label = name),
    #           size = 3.5)
    geom_label(data = example_apps,
              aes(x = arithmetic_intensity, y = performance * 0.82,
                  label = name),
              size = 3.5,
              fill = rgb(0, 0, 0, 0.4),
              color = "white",
              label.padding = unit(0.15, "lines"),
              label.size = 0)  # Removes border

ggsave("results/sc25/figures/h100_roofline_model.pdf", roofline_plot,
       width = 10, height = 7, dpi = 300)
ggsave("results/sc25/figures/h100_roofline_model_with_apps.pdf", roofline_plot_with_apps,
       width = 7.5, height = 4, dpi = 300)
#+END_SRC

#+RESULTS:
: Warning message:
: Removed 36 rows containing missing values or values outside the scale range (`geom_line()`).
: Warning message:
: Removed 36 rows containing missing values or values outside the scale range (`geom_line()`).
